# 10장. apply 메소드 활용
apply 메소드는 사용자가 작성한 함수를 한 번에 데이터프레임의 각 행과 열에 적용하여 실행할 수 있도록 해주는 함수이다.

물론 for 문을 사용하여 적용할 수 있지만, apply가 훨씬 빠르기 때문에 사용법을 익혀두는 것이 좋다.

## 10.1 간단한 함수 생성
### 10.1.1 제곱 함수와 n 제곱 함수 만들기(202쪽)

In [1]:
import pandas as pd
import numpy as np
s = pd.Series([1,2,3])
df = pd.DataFrame(np.arange(15).reshape(5,3), 
                  columns=['a', 'b', 'c'])
df

    a   b   c
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [7]:
df.agg('mean')

a    6.0
b    7.0
c    8.0
dtype: float64

In [3]:
df.agg(['sum', 'min'])

      a   b   c
sum  30  35  40
min   0   1   2

In [4]:
df.agg({'a' : ['sum', 'min'], 'b' : ['min'], 'c':['max']})

        a    b     c
max   NaN  NaN  14.0
min   0.0  1.0   NaN
sum  30.0  NaN   NaN

In [8]:
df.apply(['mean', 'sum'])

         a     b     c
mean   6.0   7.0   8.0
sum   30.0  35.0  40.0

In [9]:
df.apply({'a' : ['sum', 'min'], 'b' : ['min'], 'c':['max']})

        a    b     c
max   NaN  NaN  14.0
min   0.0  1.0   NaN
sum  30.0  NaN   NaN

In [10]:
s.apply(lambda x: x**2)

0    1
1    4
2    9
dtype: int64

In [11]:
s.map(lambda x: x**2)

0    1
1    4
2    9
dtype: int64

In [13]:
s.map(np.sqrt)

0    1.000000
1    1.414214
2    1.732051
dtype: float64

In [9]:
df.transform([np.sqrt, np.exp])

          a                        b                        c
       sqrt            exp      sqrt            exp      sqrt           exp
0  0.000000       1.000000  1.000000       2.718282  1.414214  7.389056e+00
1  1.732051      20.085537  2.000000      54.598150  2.236068  1.484132e+02
2  2.449490     403.428793  2.645751    1096.633158  2.828427  2.980958e+03
3  3.000000    8103.083928  3.162278   22026.465795  3.316625  5.987414e+04
4  3.464102  162754.791419  3.605551  442413.392009  3.741657  1.202604e+06

In [14]:
df.apply([np.sqrt, np.exp])

          a                        b                        c
       sqrt            exp      sqrt            exp      sqrt           exp
0  0.000000       1.000000  1.000000       2.718282  1.414214  7.389056e+00
1  1.732051      20.085537  2.000000      54.598150  2.236068  1.484132e+02
2  2.449490     403.428793  2.645751    1096.633158  2.828427  2.980958e+03
3  3.000000    8103.083928  3.162278   22026.465795  3.316625  5.987414e+04
4  3.464102  162754.791419  3.605551  442413.392009  3.741657  1.202604e+06

In [18]:
s.map([np.sqrt, np.exp])

TypeError: 'list' object is not callable

In [17]:
df.applymap([np.sqrt, np.exp])

TypeError: ("'list' object is not callable", 'occurred at index a')

In [15]:
s.apply([np.sqrt, np.exp])

       sqrt        exp
0  1.000000   2.718282
1  1.414214   7.389056
2  1.732051  20.085537

In [19]:
def my_sq(x):
    return x ** 2

In [20]:
def my_exp(x, n):
    return x ** n

In [21]:
print(my_sq(4))

16

In [22]:
print(my_exp(2, 4))

16

<font color='red'>[Quiz] </font> 위 함수를 lambda 함수로 작성해 보세요.

In [23]:
my_sq = lambda x: x ** 2
my_exp = lambda x, n: x ** n

## 10.2 apply 메소드 사용하기
### 10.2.1 시리즈와 데이터프레임에 apply 메서드 사용(203쪽)

#### 1) 시리즈와 apply 메서드

In [24]:
import pandas as pd

df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]}) 
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [25]:
print(df['a'] ** 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [26]:
sq = df['a'].apply(my_sq) 
print(sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [27]:
df['a'].map(my_sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [29]:
ex = df['a'].apply(lambda x: my_exp(x, 2))
ex

0    100
1    400
2    900
Name: a, dtype: int64

In [11]:
ex = df['a'].apply(my_exp, n=3) 
print(ex)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [35]:
df['a'].apply([lambda x: my_exp(x, 2), my_sq])

   <lambda>  <lambda>
0       100       100
1       400       400
2       900       900

In [12]:
import numpy as np
df.a.mean()
df.a.apply('mean')
df.a.apply(['mean', 'sum'])

mean    20.0
sum     60.0
Name: a, dtype: float64

#### 2) 데이터 프레임과 apply 메서드
이때, axis=0은 열방향을 지정하며, axis=1은 행방향을 지정한다.

In [36]:
df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]}) 
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [37]:
df.apply(my_sq)

     a     b
0  100   400
1  400   900
2  900  1600

In [38]:
def print_me(x): 
    print(x)

In [39]:
print(df.apply(print_me, axis=0))

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

In [17]:
print(df['a'])

0    10
1    20
2    30
Name: a, dtype: int64

In [18]:
print(df['b'])

0    20
1    30
2    40
Name: b, dtype: int64

In [40]:
print(df.apply(print_me, axis=1))

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64
0    None
1    None
2    None
dtype: object

In [42]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [41]:
def avg_3(x, y, z):
    return (x + y + z) / 3

그런데 avg_3 함수를 apply 메서드에 전달하면 
- avg_3 함수는 3개의 인잣값을 필요로 하는 함수인데 "1개의 인잣값만 입력받았다"는 오류 메시지가 출력됩니다. 
- 즉, avg_3 함수에 열 단위 데이터(df['a'] 또는 df['b'])가 전달되었고 
- 이 값을 avg_3 함수에서 1개의 인자로 인식한 것입니다. 

따라서 avg_3 함수가 열 단위로 데이터를 처리할 수 있도록 수정해야 합니다.

In [46]:
try:
    print(df.apply(avg_3))
except TypeError as e:
    print(e)

("avg_3() missing 2 required positional arguments: 'y' and 'z'", 'occurred at index a')

수정한 함수를 적용하면:

In [43]:
def avg_3_apply(col):
    x = col[0] 
    y = col[1] 
    z = col[2] 
    return (x + y + z) / 3

print(df.apply(avg_3_apply))

a    20.0
b    30.0
dtype: float64

In [31]:
def avg_3_apply(col):
    sum = 0
    for item in col:
         sum += item
    return sum / df.shape[0]

<font color='red'>[Quiz] </font> 위 함수를 numpy 함수로 일반화하면:

In [47]:
def avg(col):
    return col.sum() / len(col)

In [48]:
df.apply(avg, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

행방향으로 수행하는 함수를 다음과 같이 작성할 수 있다.

In [50]:
def avg_2_apply(row):
    sum = 0
    for item in row:
        sum += item
    return sum / df.shape[1]

In [52]:
print(df.apply(avg, axis = 1))

0    15.0
1    25.0
2    35.0
dtype: float64

[Quiz] sns의 tips 데이터에서 sex와 time별 tipRate top5를 구하여라.

1. tipRate = tip/total_bill 를 구한다.
2. tipRate로 정렬하여 top5를 구하는 함수 ft를 작성한다.
3. sex와 time으로 그룹하여 ft를 적용(apply)한다.

In [60]:
import seaborn as sns

In [61]:
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [62]:
tips['tipRate'] = tips.tip / tips.total_bill

In [63]:
def top5(df, var='tipRate', asc=False, n=5):
    return df.sort_values(var, ascending=asc).head(n)

In [68]:
tips.groupby(['sex', 'time']).apply(top5)

                   total_bill   tip     sex smoker   day    time  size  \
sex    time
Male   Lunch  149        7.51  2.00    Male     No  Thur   Lunch     2
              194       16.58  4.00    Male    Yes  Thur   Lunch     2
              88        24.71  5.85    Male     No  Thur   Lunch     2
              222        8.58  1.92    Male    Yes   Fri   Lunch     1
              87        18.28  4.00    Male     No  Thur   Lunch     2
       Dinner 172        7.25  5.15    Male    Yes   Sun  Dinner     2
              232       11.61  3.39    Male     No   Sat  Dinner     2
              183       23.17  6.50    Male    Yes   Sun  Dinner     4
              181       23.33  5.65    Male    Yes   Sun  Dinner     2
              185       20.69  5.00    Male     No   Sun  Dinner     5
Female Lunch  221       13.42  3.48  Female    Yes   Fri   Lunch     2
              191       19.81  4.19  Female    Yes  Thur   Lunch     2
              139       13.16  2.75  Female     No  Thur   Lunch     2
              124       12.48  2.52  Female     No  Thur   Lunch     2
              140       17.47  3.50  Female     No  Thur   Lunch     2
       Dinner 178        9.60  4.00  Female    Yes   Sun  Dinner     2
              67         3.07  1.00  Female    Yes   Sat  Dinner     1
              109       14.31  4.00  Female    Yes   Sat  Dinner     2
              93        16.32  4.30  Female    Yes   Fri  Dinner     2
              51        10.29  2.60  Female     No   Sun  Dinner     2

                    tipRate
sex    time
Male   Lunch  149  0.266312
              194  0.241255
              88   0.236746
              222  0.223776
              87   0.218818
       Dinner 172  0.710345
              232  0.291990
              183  0.280535
              181  0.242177
              185  0.241663
Female Lunch  221  0.259314
              191  0.211509
              139  0.208967
              124  0.201923
              140  0.200343
       Dinner 178  0.416667
              67   0.325733
              109  0.279525
              93   0.263480
              51   0.252672

## 10.3 apply 고급 사용법
### 10.3.1 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용(208쪽)

#### 1) 데이터프레임의 누락값 처리하기 ― 열 방향

In [69]:
import seaborn as sns

titanic = sns.load_dataset("titanic")

In [70]:
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

In [71]:
import numpy as np

def count_missing(vec):
    return pd.isnull(vec).sum()

In [72]:
cmis_col = titanic.apply(count_missing)
print(cmis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [73]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num / dem

In [74]:
pmis_col = titanic.apply(prop_missing)
print(pmis_col)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [75]:
def prop_complete(vec): # 비결측율
    return 1 - prop_missing(vec)

#### 2)  데이터프레임의 누락값을 처리하기 ― 행 방뱡

In [76]:
cmis_row = titanic.apply(count_missing, axis=1)
pmis_row = titanic.apply(prop_missing, axis=1)
pcom_row = titanic.apply(prop_complete, axis=1)

print(cmis_row.head())

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [55]:
print(pmis_row.head())

0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64

In [56]:
print(pcom_row.head())

0    0.933333
1    1.000000
2    0.933333
3    1.000000
4    0.933333
dtype: float64

In [77]:
titanic['num_missing'] = titanic.apply(count_missing, axis=1)

print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  num_missing
0    man        True  NaN  Southampton    no  False            1
1  woman       False    C    Cherbourg   yes  False            0
2  woman       False  NaN  Southampton   yes   True            1
3  woman       False    C  Southampton   yes  False            0
4    man        True  NaN  Southampton    no   True            1

In [78]:
print(titanic.loc[titanic.num_missing > 1, :].sample(10))
titanic[titanic.num_missing > 1].sample(10)

     survived  pclass     sex  age  sibsp  parch      fare embarked   class  \
557         0       1    male  NaN      0      0  227.5250        C   First
270         0       1    male  NaN      0      0   31.0000        S   First
264         0       3  female  NaN      0      0    7.7500        Q   Third
413         0       2    male  NaN      0      0    0.0000        S  Second
451         0       3    male  NaN      1      0   19.9667        S   Third
274         1       3  female  NaN      0      0    7.7500        Q   Third
46          0       3    male  NaN      1      0   15.5000        Q   Third
613         0       3    male  NaN      0      0    7.7500        Q   Third
159         0       3    male  NaN      8      2   69.5500        S   Third
109         1       3  female  NaN      1      0   24.1500        Q   Third

       who  adult_male deck  embark_town alive  alone  num_missing
557    man        True  NaN    Cherbourg    no   True            2
270    man        True  NaN  Southampton    no   True            2
264  woman       False  NaN   Queenstown    no   True            2
413    man        True  NaN  Southampton    no   True            2
451    man        True  NaN  Southampton    no  False            2
274  woman       False  NaN   Queenstown   yes   True            2
46     man        True  NaN   Queenstown    no  False            2
613    man        True  NaN   Queenstown    no   True            2
159    man        True  NaN  Southampton    no  False            2
109  woman       False  NaN   Queenstown   yes  False            2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
459,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2
415,0,3,female,NaN,0,0,8.0500,S,Third,woman,False,NaN,Southampton,no,True,2
643,1,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True,2
709,1,3,male,NaN,1,1,15.2458,C,Third,man,True,NaN,Cherbourg,yes,False,2
828,1,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,yes,True,2
568,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True,2
240,0,3,female,NaN,1,0,14.4542,C,Third,woman,False,NaN,Cherbourg,no,False,2
596,1,2,female,NaN,0,0,33.0000,S,Second,woman,False,NaN,Southampton,yes,True,2
557,0,1,male,NaN,0,0,227.5250,C,First,man,True,NaN,Cherbourg,no,True,2
42,0,3,male,NaN,0,0,7.8958,C,Third,man,True,NaN,Cherbourg,no,True,2